{
 "allow_comments": 0,
 "allow_delete": 0,
 "allow_edit": 0,
 "allow_incomplete": 0,
 "allow_multiple": 0,
 "allow_print": 0,
 "anonymous": 0,
 "apply_document_permissions": 0,
 "button_label": "Save",
 "client_script": "frappe.web_form.after_load=()=>{\r\nfrappe.web_form.on('select_name',(field,value)=>{\r\n\r\n\r\n\r\n//HOT AIR OVEN\r\n\r\n\r\n\r\n\r\nif (value == 'HOT AIR OVEN'){\r\nlet paragraph=\"<h3>HOT AIR OVEN </h3><br>\"+\r\n\"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\"<p>A hot air oven is a laboratory instrument used for sterilization, drying, and heat-treating <br> various materials. While its primary applications are often associated with microbiology,<br> medical laboratories, and material testing, there are some potential uses for a hot air oven in a<br> wastewater treatment laboratory as well:</p>\" +\r\n\"<p>• Drying of Samples:</p>\" +\r\n\"<p>Wastewater samples collected for analysis may contain water, and drying them in a hot air <br> oven can be necessary to obtain accurate measurements of solids content or to <br> prepare samples for specific tests. </p>\" +\r\n\"<p>• Sample Preparation:</p>\" +\r\n\"<p>Some analytical methods in wastewater treatment labs may require dried or dehydrated samples.<br> The hot air oven can be used to prepare samples by removing moisture and facilitating subsequent analyses.</p>\"+\r\n\"<p>• Sterilization of Glassware:</p>\"+\r\n\"<p>Sterilization is crucial in laboratories to prevent contamination. Hot air ovens can be used to<br> sterilize glassware, including beakers, flasks, and other equipment used in wastewater sample <br> collection and analysis.<p>\"+\r\n\"<p>• Deactivation of Microorganisms:</p>\"+\r\n\"<p>In certain experiments or studies involving microorganisms in wastewater, it may be <br> necessary to deactivate or kill the microorganisms before further analysis. The hot air oven <br> can be used for this purpose.</p>\"+\r\n\"<p>• Evaporation of Solvents:</p>\"+\r\n\"<p> In some wastewater treatment processes, solvents are used for extraction or analysis. </p>\"+\r\n\"<p>• Drying of Filter Papers:</p>\"+\r\n\"<p> Filter papers used in the separation and analysis of suspended solids in wastewater samples <br> need to be thoroughly dried before and after use. The hot air oven is suitable for this purpose.</p>\"+\r\n\"<p>• Preparation of Reagents:</p>\"+\r\n\"<p>Some reagents used in wastewater analysis may require drying or heat treatment to maintain <br> stability or to remove traces of moisture. The hot air oven can be used for the preparation of <br> such reagents.</p>\"+\r\n\"<p>OUR HOT AIR OVEN-- Make: P-LAB</p>\"+\r\n\"<a href='https://plficbe.com/digital-hot-air-oven.php' target='_blank'>Click here to link </a>\";\r\n\r\nlet concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n}\r\n\r\n\r\n\r\n\r\n//Chemical Oxygen Demand (COD)\r\n\r\n\r\nelse if (value=='Chemical Oxygen Demand (COD)') {\r\n  \r\n   let paragraph = \"<h3>Chemical Oxygen Demand (COD)</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>Chemical Oxygen Demand (COD) is a measure of the amount of oxygen required to chemically <br> oxidize organic and inorganic substances in water. It is often used as an indirect indicator of the <br> organic content and overall pollution level in wastewater. COD is expressed in milligrams of <br> oxygen per Liter (mg/L).</p>\" + \r\n\t    \"<p>• Quantification of Organic Load:</p>\"+\r\n\t    \"<p>COD provides a quantitative measure of the amount of organic pollutants present in wastewater. High COD levels indicate a higher concentration of organic compounds that need to be removed during treatment.</p>\"+\r\n        \"<p>• Process Optimization:</p>\"+\r\n        \"<p>Monitoring COD allows for the optimization of treatment processes. By adjusting conditions such as aeration, coagulant dosages, and microbial activity based on COD levels, operators can enhance the efficiency of the treatment system.</p>\"+\r\n        \"<p>• Performance Evaluation:</p>\"+\r\n        \"<p>COD is used to evaluate the performance of wastewater treatment processes. Regular monitoring helps assess how well the treatment plant is removing organic pollutants and meeting regulatory standards.</p>\"+\r\n        \"<p>• Environmental Impact Assessment:</p>\"+\r\n        \"<p>High COD levels in discharged effluent can have negative environmental impacts. It may lead to oxygen depletion in receiving water bodies, affecting aquatic ecosystems. Monitoring COD helps ensure that treated effluent meets environmental regulations.Several methods are commonly used to determine COD in wastewater:</p>\"+\r\n        \"<p>• Closed Reflux Method (Standard Method 5220D):</p>\"+\r\n        \"<p>In this method, a closed system is used to reflux a wastewater sample with a strong oxidizing agent (such as potassium dichromate) in the presence of sulfuric acid. The remaining unreacted oxidant is titrated with a reducing agent, and the amount used is proportional to the COD.</p>\"+\r\n        \"<p>• Open Reflux Method (Standard Method 5220C):</p>\"+\r\n        \"<p>Similar to the closed reflux method, but in this case, the system is open to the atmosphere during the reaction. This method is often preferred for samples containing volatile organic compounds.</p>\"+\r\n        \"<p>• Infrared (IR) Digestion:</p>\"+\r\n        \"<p>Infrared digestion methods involve oxidizing the organic matter in the sample using an IR source. The amount of CO2 produced is then used to calculate the COD.OUR COD DIGESTER -- Make: SOXHLET APPARATUS</p>\"+\r\n        \"<p>OUR COD DIGESTER -- Make: SOXHLET APPARATUS</p>\"+\r\n        \"<a href='https://extension.uga.edu/publications/detail.html?number=C992&title=understanding-laboratory-wastewater-tests-i-organics-bod-cod-toc-og#COD' target='_blank'>Click here to link </a>\";\r\n\r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\t     \r\n}\t\r\n\r\n\r\n\r\n//TDS METER\r\n\r\nelse if (value=='TDS METER') {\r\n  \r\n   let paragraph = \"<h3>TDS METER</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>Total Dissolved Solids (TDS) is a measure of the combined content of all inorganic and organic substances that are dissolved in a liquid, typically water. It includes minerals, salts, metals, cations, anions, and other small organic molecules. TDS is commonly expressed in parts per million (ppm) or milligrams per liter (mg/L).</p>\"+\r\n        \"<p>TDS is an important parameter in wastewater treatment for several reasons:</p>\" + \r\n\t    \"<p>• Water Quality Assessment::</p>\"+\r\n\t    \"<p>TDS is used as an indicator of water quality. High TDS levels can affect the taste, odor, and overall aesthetic quality of water. Monitoring TDS helps assess the suitability of water for various uses, including drinking water.</p>\"+\r\n        \"<p>• Impact on Treatment Processes:</p>\"+\r\n        \"<p>TDS can influence the efficiency of various wastewater treatment processes. For example, high TDS levels may affect the performance of biological treatment processes by impacting microbial activity. TDS can also contribute to scaling in pipes and equipment.</p>\"+\r\n        \"<p>• Salinity and Ecosystem Impact:</p>\"+\r\n        \"<p>In wastewater discharged into natural water bodies, elevated TDS levels can contribute to increased salinity. This can have adverse effects on aquatic ecosystems, including changes in the composition of flora and fauna.</p>\"+\r\n        \"<p>Ways to Find TDS:</p>\"+\r\n        \"<p>• Conductivity Measurements:</p>\"+\r\n        \"<p>TDS is often estimated by measuring the electrical conductivity of a solution. Since dissolved ions contribute to conductivity, the conductivity value can be correlated with TDS levels. However, this method provides an estimate rather than a direct measurement.</p>\"+\r\n        \"<p>• TDS Meter:</p>\"+\r\n        \"<p>TDS meters are handheld devices that measure the electrical conductivity of a solution and convert it into an estimate of TDS. These meters are convenient and widely used for field measurements.</p>\"+\r\n        \"<p>• Laboratory Analysis:</p>\"+\r\n        \"<p>In a laboratory setting, TDS can be measured more precisely using techniques such as gravimetric analysis, ion chromatography, or specific chemical tests for individual ions.</p>\"+\r\n        \"<P>OUR TURBIDITY METER-- Make: EUTECH-CON 510   </P>\"+\r\n        \"<a href='http://www.eutechinst.com/pdt-para-conductivity-cyberscancon510.html' target='_blank'>Click here to link </a>\";\r\n       \r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\t     \r\n}\t   \r\n\r\n//pH METER\r\n\r\nelse if (value=='pH METER') {\r\n  \r\n   let paragraph = \"<h3>pH METER</h3><br> \" +\r\n    \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>pH is a measure of the acidity or alkalinity of a solution. It is defined as the negative logarithm (base 10) of the hydrogen ion concentration in moles per liter. The pH scale ranges from 0 to 14, where a pH of 7 is considered neutral. Values below 7 indicate acidity, while values above 7 indicate alkalinity. pH is an essential parameter in various fields, including chemistry, biology, environmental science, and industry.</p>\"+\r\n        \"<p>Uses of pH in Wastewater Treatment:</p>\" + \r\n\t    \"<p>• pH plays a crucial role in wastewater treatment processes. Maintaining the appropriate pH levels is essential for the efficiency of various treatment methods. Some key uses include:</p>\"+\r\n\t    \"<p>• Biological Treatment: pH affects the activity of microorganisms in biological treatment processes. Many microorganisms function optimally within a specific pH range, and maintaining this range enhances the breakdown of organic matter.</p>\"+\r\n        \"<p>• Chemical Precipitation: pH influences the solubility of certain chemicals. Adjusting pH can promote the precipitation of impurities, making them easier to remove through sedimentation or filtration.</p>\"+\r\n        \"<p>• Coagulation and Flocculation: In water treatment, coagulants and flocculants are often added to facilitate the removal of suspended particles. pH adjustments optimize the performance of these chemicals.</p>\"+\r\n        \"<p>Ways to Measure pH:</p>\"+\r\n        \"<p>There are several methods to measure pH, including:</p>\"+\r\n        \"<p>• pH Paper or Strips: These are simple and cost-effective. pH paper changes colour based on the pH of the solution, and the colour is then compared to a standardized chart.</p>\"+\r\n        \"<p>pH Indicator Solution: Liquid indicator solutions change colour depending on the pH. They are added to the solution being tested, and the resulting colour is matched to a chart.</p>\"+\r\n        \"<p>• pH Meter: A pH meter is a more precise instrument that directly measures the electrical potential of a solution. It provides a numerical pH value, and pH meters are widely used in laboratories and industrial settings.</p>\"+\r\n        \"<p>OUR pH METER MAKE:  ProMinent – DULCOMETER</p>\"+\r\n        \"<a href= 'https://www.prominent.com/en/Products/Products/Measuring-Control-and-Sensor-Technology/Controllers/p-dulcometer-compact.html' target='_blank'>Click here to link</a>\";\r\n        \r\n\r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n\r\n//TURBIDITY METER\r\n\r\nelse if (value=='TURBIDITY METER') {\r\n  \r\n   let paragraph = \"<h3>TURBIDITY METER</h3><br> \" +\r\n\t    \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>Turbidity refers to the cloudiness or haziness of a fluid caused by the presence of suspended particles, such as clay, silt, plankton, or other microscopic matter. These particles scatter and absorb light, making the water appear cloudy. Turbidity is typically measured in nephelometric turbidity units (NTU) or formazin nephelometric units (FNU).</p>\"+\r\n        \"<p>Turbidity is an important parameter in wastewater treatment for several reasons:</p>\" + \r\n\t    \"<p>• Indicator of Water Quality:</p>\"+\r\n\t    \"<p>Turbidity serves as an indicator of the overall quality of water. Higher turbidity levels often suggest the presence of suspended solids, which can impact the efficiency of treatment processes and affect the quality of the treated effluent.</p>\"+\r\n        \"<p>• Affects Treatment Processes:</p>\"+\r\n        \"<p>High turbidity can interfere with various treatment processes. For example, it may hinder the effectiveness of sedimentation and filtration processes by preventing the settling or removal of suspended particles.</p>\"+\r\n        \"<p>• Impact on Disinfection:</p>\"+\r\n        \"<p>Turbidity can interfere with the effectiveness of disinfection processes such as chlorination. Suspended particles can shield microorganisms from the disinfectant, reducing the overall efficiency of pathogen removal.</p>\"+\r\n        \"<p>Ways to Measure Turbidity:</p>\"+\r\n        \"<p>There are several methods to measure turbidity, ranging from simple visual assessments to more sophisticated laboratory techniques. Common methods include:</p>\"+\r\n        \"<p>• Turbidity Meter:</p>\"+\r\n        \"<p>A turbidity meter, also known as a turbidimeter, is an instrument designed specifically for measuring turbidity. It uses a light source and a detector to measure the amount of light scattered by suspended particles in the water. The results are often reported in NTU or FNU.</p>\"+\r\n        \"<p>• Nephelometric Method:</p>\"+\r\n        \"<p>The nephelometric method involves measuring the intensity of scattered light at a 90-degree angle to the incident light. This method is commonly used in turbidity meters and provides a standardized way to quantify turbidity.</p>\"+\r\n        \"<p>OUR TURBIDITY METER-- Make: EUTECH-TN 100</p>\"+\r\n        \"<a href='http://www.eutechinst.com/pdt-para-turbidity-tse-tn100.html' target='_blank'>Click here to link </a>\";\r\n       \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n//MAGNETIC STIRRER\r\n\r\nelse if (value=='MAGNETIC STIRRER') {\r\n  \r\n   let paragraph = \"<h3>MAGNETIC STIRRER</h3><br> \" +\r\n        \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>Magnetic stirrers are versatile laboratory devices commonly used in various scientific and industrial settings, including wastewater treatment labs. Here are some potential uses of magnetic stirrers in a wastewater treatment laboratory:</p>\"+\r\n        \"<p>• Sample Homogenization:</p>\" + \r\n\t    \"<p>Magnetic stirrers are employed to mix and homogenize wastewater samples before analysis. This ensures that the sample is representative and that any suspended or dissolved substances are evenly distributed.</p>\"+\r\n\t    \"<p>• Chemical Reagent Mixing:</p>\"+\r\n        \"<p>In the preparation of chemical reagents for wastewater analysis, magnetic stirrers help achieve thorough mixing. This is important for obtaining accurate and consistent results in chemical tests and experiments.</p>\"+\r\n        \"<p>TDS can influence the efficiency of various wastewater treatment processes. For example, high TDS levels may affect the performance of biological treatment processes by impacting microbial activity. TDS can also contribute to scaling in pipes and equipment.</p>\"+\r\n        \"<p>• Dissolving Solids:</p>\"+\r\n        \"<p>Some wastewater samples may contain solids that need to be dissolved for analysis. Magnetic stirrers facilitate the dissolution process by providing continuous mixing, ensuring that solid particles are evenly distributed throughout the solution.</p>\"+\r\n        \"<p>• pH Adjustment:</p>\"+\r\n        \"<p>During pH adjustment procedures, such as the addition of acids or bases to control the pH of a sample, magnetic stirrers help in achieving uniform mixing. This ensures that the pH adjustment is consistent throughout the sample.</p>\"+\r\n        \"<p>• Chemical Reaction Monitoring:</p>\"+\r\n        \"<p>Magnetic stirrers are used to monitor chemical reactions in wastewater treatment experiments. They ensure that reactants are evenly distributed, promoting efficient and uniform reactions.</p>\"+\r\n        \"<p>• Sedimentation Studies:</p>\"+\r\n        \"<p>Magnetic stirrers can be used in studies related to sedimentation processes. For instance, they can help investigate settling rates of suspended particles in wastewater under different conditions.</p>\"+\r\n        \"<p>• Laboratory-scale Simulations:</p>\"+\r\n        \"<p>Magnetic stirrers are valuable for simulating and studying various treatment processes on a smaller scale in the laboratory. They enable researchers to test and optimize treatment methods before implementation on a larger scale.</p>\"+\r\n        \"<p> OUR MAGNETIC STIRRER-- Make: BOROSIL</p>\"+\r\n        \"<a href='https://labquest.co/products/hot-plates-and-stirrers/hot-plate-magnetic-stirrer/' target='_blank'>Click here to link </a>\";\r\n        \r\n        \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n//MUFFLE FURNACE\r\n\r\nelse if (value=='MUFFLE FURNACE') {\r\n  \r\n   let paragraph = \"<h3>MUFFLE FURNACE</h3><br> \" +\r\n        \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>A muffle furnace is a type of furnace designed for high-temperature applications, typically used for processes such as ashing, heat treatment, and combustion. While muffle furnaces are not as commonly associated with wastewater treatment labs as they are with materials testing or analytical chemistry labs, there are some potential uses for them in the context of wastewater treatment:</p>\"+\r\n        \"<p>• Organic Content Analysis:</p>\" + \r\n\t    \"<p>Muffle furnaces can be employed for organic content analysis by burning off organic matter from samples. This can be useful in studying the thermal degradation of organic materials present in wastewater samples.</p>\"+\r\n\t    \"<p>• Volatile Solid Determination:</p>\"+\r\n        \"<p>Wastewater sludge often contains volatile solids, which can be measured by subjecting the sample to high temperatures in a muffle furnace. The remaining residue after heating is an indicator of the volatile solid content.</p>\"+\r\n        \"<p>• Drying of Wet Samples:</p>\"+\r\n        \"<p>Muffle furnaces can be used for the efficient drying of wet samples or substances collected from wastewater. This is particularly important when precise measurements of solids content or other parameters are required.</p>\"+\r\n        \"<p>• Destruction of Organic Compounds:</p>\"+\r\n        \"<p>Muffle furnaces can be used to thermally decompose or destroy specific organic compounds in samples, facilitating subsequent analyses by other methods</p>\"+\r\n        \"<p>• Dehydration of Samples:</p>\"+\r\n        \"<p>In some wastewater treatment analyses, samples may need to be dehydrated before further processing or testing. A muffle furnace can efficiently remove water content from samples.</p>\"+\r\n        \"<p>• Catalyst Activation:</p>\"+\r\n        \"<p>If a wastewater treatment process involves the use of catalysts, a muffle furnace can be used to activate or prepare these catalysts by subjecting them to high temperatures.</p>\"+\r\n        \"<p>OUR MUFFLE FURNACE -- Make: P-LAB</p>\"+\r\n        \"<a href='https://plficbe.com/lab-instruments-manufacturer.php' target='_blank'>Click here to link </a>\";\r\n        \r\n        \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n\r\n//JAR TEST APPARATUS\r\n\r\nelse if (value=='JAR TEST APPARATUS') {\r\n  \r\n   let paragraph = \"<h3>JAR TEST APPARATUS</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t    \"<p>Jar test apparatus is a common tool used in wastewater treatment laboratories to simulate and optimize the coagulation and flocculation processes. Here are some specific uses of jar test apparatus in a wastewater treatment lab:</p>\"+\r\n        \"<p>• Optimization of Coagulant Dosage:</p>\" + \r\n\t    \"<p>Jar tests are conducted to determine the optimal dosage of coagulants (such as alum or ferric chloride) needed to destabilize suspended particles and promote the formation of flocs. Various dosages are tested in separate jars to find the most effective concentration.</p>\"+\r\n\t    \"<p>• Evaluation of Flocculant Performance:</p>\"+\r\n        \"<p>Jar tests help assess the effectiveness of flocculants in promoting the aggregation and settling of suspended particles. Different flocculant types and dosages can be tested to find the most efficient treatment.</p>\"+\r\n        \"<p>• pH Adjustment Studies:</p>\"+\r\n        \"<p>The jar test apparatus allows researchers to study the impact of pH on coagulation and flocculation. Adjustments to the pH of wastewater samples can be made, and the jar test helps identify the optimal pH range for effective treatment.</p>\"+\r\n        \"<p>• Determination of Settling Characteristics:</p>\"+\r\n        \"<p>Jar tests help evaluate the settling characteristics of flocs formed during coagulation and flocculation processes. This information is crucial for designing settling tanks and clarifiers in wastewater treatment plants.</p>\"+\r\n        \"<p>• Identification of Optimal Mixing Conditions:</p>\"+\r\n        \"<p>The apparatus enables the study of optimal mixing conditions, including mixing intensity and duration. Efficient mixing is essential for the uniform distribution of coagulants and flocculants in wastewater.</p>\"+\r\n        \"<p>• Testing Different Coagulants:</p>\"+\r\n        \"<p>Jar tests allow for the comparison of different coagulants to determine their effectiveness in a particular wastewater sample. This information helps in selecting the most suitable coagulant for full-scale treatment.</p>\"+\r\n        \"<p>• Simulating Treatment Plant Conditions:</p>\"+\r\n        \"<p> Jar tests provide a small-scale simulation of the conditions in a wastewater treatment plant. This allows for the optimization of treatment processes before implementing changes on a larger scale.</p>\"+\r\n        \"<p>• Assessment of Colour Removal:</p>\"+\r\n        \"<p>For wastewater containing color-producing compounds, jar tests help evaluate the efficiency of coagulants and flocculants in color removal. This is particularly important in industries such as textile or dyeing, where color removal is a critical aspect of treatment.</p>\"+\r\n        \"<p>OUR JAR TEST APPARATUS -- Make: KSHITIZ INNOVATION</p>\"+\r\n        \"<a href='https://www.kshitijinnovation.com/product-detail.php?id=761' target='_blank'>Click here to link  </a>\";\r\n       \r\n        \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n//MICROSCOPE\r\n\r\n\r\nelse if (value=='MICROSCOPE') {\r\n  \r\n   let paragraph = \"<h3>MICROSCOPE</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t   \"<p>Microscopes are essential tools in wastewater treatment laboratories, enabling researchers and operators to observe and analyze microscopic structures, particles, and organisms. Here are several specific uses of microscopes in wastewater treatment labs:</p>\"+\r\n\t   \"<p>• Microbial Analysis:</p>\"+\r\n\t   \"<p>Microscopes are used to identify and analyze microorganisms in wastewater samples. This includes bacteria, algae, fungi, and other microscopic organisms. Understanding microbial populations is crucial for assessing the efficiency of biological treatment processes.</p>\"+\r\n\t   \"<p>• Filamentous Organism Identification</p>\"+\r\n\t   \"<p>Filamentous microorganisms, such as certain types of bacteria and fungi, can impact the performance of wastewater treatment systems. Microscopes help identify and quantify these organisms, aiding in troubleshooting and process optimization.</p>\"+\r\n\t   \"<p>• Activated Sludge Examination:</p>\"+\r\n\t   \"<p>Microscopes are employed to examine activated sludge samples, providing insights into the health and composition of the microbial community. This information is valuable for maintaining optimal conditions in wastewater treatment plants.</p>\"+\r\n\t   \"<p>• Particle Size Analysis:</p>\"+\r\n\t   \"<p>Microscopes are used for the analysis of particle size in wastewater samples. This includes the characterization of suspended solids, flocs, and other particulate matter. Understanding particle size distribution is essential for optimizing sedimentation and filtration processes.</p>\"+\r\n\t   \"<p>• Observation of Settling Characteristics:</p>\"+\r\n\t   \"<p>Microscopic examination allows for the observation of settling characteristics of flocs formed during coagulation and flocculation processes. This information is vital for designing efficient settling tanks and clarifiers.</p>\"+\r\n\t   \"<p>• Microscopic Examination of Effluent Quality</p>\"+\r\n\t   \"<p>Microscopes are used to examine the quality of treated wastewater effluent. This includes assessing the presence of any residual microorganisms or particles that may affect the discharge quality.</p>\"+\r\n\t   \"<p>• Microscopic Evaluation of Sludge Characteristics:</p>\"+\r\n\t   \"<p>Sludge is a byproduct of wastewater treatment, and microscopes are used to analyze its characteristics. This includes the observation of sludge settleability, the presence of microorganisms, and the identification of any abnormalities.</p>\"+\r\n\t   \"<p>• Study of Nitrification and Denitrification:</p>\"+\r\n\t   \"<p>Microscopic examination is crucial for studying the nitrification and denitrification processes in wastewater treatment plants. It helps identify the relevant microorganisms involved in these nitrogen transformations.</p>\"+\r\n\t   \"<p>OUR MICROSCOPE -- Make: OLYMPUS INDIA- CH20i<p/>\"+\r\n\t   \"<a href='https://www.alanwood.net/downloads/olympus-ch20i-brochure.pdf' target='_blank'>Click here to link </p>\";\r\n\r\n        \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n//ANALYTICAL BALANCE\r\n\r\nelse if (value=='ANALYTICAL BALANCE') {\r\n  \r\n   let paragraph = \"<h3>ANALYTICAL BALANCE</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t   \"<p>Weighing machines, or balances, are essential tools in wastewater treatment laboratories for accurately measuring and quantifying various substances. Here are some specific uses of weighing machines in a wastewater treatment lab:</p>\"+\r\n\t   \"<p>• Chemical Dosage Preparation:</p>\"+\r\n\t   \"<p>Weighing machines are used to measure and prepare accurate dosages of chemicals, such as coagulants, flocculants, and pH-adjusting agents, for use in wastewater treatment processes.</p>\"+\r\n\t   \"<p>• Sample Analysis</p>\"+\r\n\t   \"<p>Weighing machines are used to measure the weight of wastewater samples before and after treatment. This helps determine parameters such as Total Suspended Solids (TSS), Total Dissolved Solids (TDS), and other analytes important for water quality assessment.</p>\"+\r\n\t   \"<p>• Standard Solution Preparation:</p>\"+\r\n\t   \"<p>Weighing machines are utilized to accurately measure and prepare standard solutions for calibration purposes. These solutions are essential for calibrating analytical instruments used in the lab.</p>\"+\r\n\t   \"<p>• Weighing Filter Papers:</p>\"+\r\n\t   \"<p>In the analysis of suspended solids, filter papers are often used to separate solids from liquid samples. Weighing machines are used to measure the initial and final weights of the filter papers, allowing for the determination of suspended solids concentration.</p>\"+\r\n\t   \"<p>• Quantification of Reagents:</p>\"+\r\n\t   \"<p>Weighing machines are crucial for quantifying reagents and chemicals used in various tests and experiments. This includes measurements for titrations, chemical reactions, and other laboratory procedures.</p>\"+\r\n\t   \"<p>• Determination of Mass Loss in Drying:</p>\"+\r\n\t   \"<p>Wastewater samples or sludge may undergo drying processes to determine the total solids content. Weighing machines are used to measure the initial and final masses, allowing for the calculation of mass loss and solids content.</p>\"+\r\n       \"<p>• Density Measurements:</p>\"+\r\n       \"<p>Weighing machines can be used in conjunction with volumetric measurements to calculate the density of liquids. This information is important for understanding the characteristics of wastewater samples.</p>\"+\r\n       \"<p>OUR ANALYTICAL BALANCE -- Make: WENSAR</p>\"+\r\n       \"<a href='https://5.imimg.com/data5/SELLER/Doc/2021/6/QN/GX/AV/943786/semi-micro-analytical-balance.pdf' target='_blank'>Click here to link </a>\";\r\n       \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n\r\n}\r\n\r\n\r\n//SPECTROPHOTOMETER\r\n\r\nelse if (value=='SPECTROPHOTOMETER') {\r\n  \r\n   let paragraph = \"<h3>SPECTROPHOTOMETER</h3><br> \" +\r\n   \"<img class='custom-div' src='https://res.cloudinary.com/wtt-international/image/upload/v1665033178/WTT/ewlpcq8snvn1bbewif8r.png'/>\"+\r\n\t   \"<p>A spectrophotometer is a widely used analytical instrument in wastewater treatment laboratories, providing valuable information about the chemical composition of water samples. Here are some specific uses of a spectrophotometer in a wastewater treatment lab:</p>\"+\r\n\t   \"<p>• Quantitative Analysis of Parameters:</p>\"+\r\n\t   \"<p>Spectrophotometers are employed for the quantitative analysis of various parameters in wastewater, including concentrations of specific ions, nutrients, metals, and organic compounds. This is achieved by measuring the absorbance or transmittance of light by the sample.</p>\"+\r\n\t   \"<p>• Colorimetric Analysis:</p>\"+\r\n\t   \"<p>Colorimetric methods, which rely on changes in color to indicate the presence or concentration of a particular substance, are commonly used in wastewater analysis. Spectrophotometers are used to measure color changes and quantify the concentration of specific substances.</p>\"+\r\n\t   \"<p>• Monitoring Nutrient Levels:</p>\"+\r\n\t   \"<p>Nutrient concentrations, such as nitrate, nitrite, and phosphate, are critical indicators in wastewater treatment. Spectrophotometers facilitate the analysis of these nutrients through colorimetric methods, allowing for the optimization of nutrient removal processes.</p>\"+\r\n\t   \"<p>• Detection of Trace Metals:</p>\"+\r\n\t   \"<p>Spectrophotometers are employed to analyze trace metal concentrations in wastewater samples. Complexation reactions with specific reagents result in color changes that can be measured to determine metal concentrations.</p>\"+\r\n\t   \"<p>• BOD and COD Measurements:</p>\"+\r\n\t   \"<p>Biochemical Oxygen Demand (BOD) and Chemical Oxygen Demand (COD) are important indicators of organic pollution in water. Spectrophotometers are used to measure color changes in BOD and COD tests, providing information about the oxygen demand and organic content of the sample.</p>\"+\r\n\t   \"<p>• Analysis of Disinfection Byproducts:</p>\"+\r\n\t   \"<p>Spectrophotometers are employed to measure the concentration of disinfection byproducts (DBPs), such as trihalomethanes, which can form during the chlorination of wastewater. Specific wavelengths are selected for the analysis of these compounds.</p>\"+\r\n\t   \"<p>• Oil and Grease Analysis:</p>\"+\r\n\t   \"<p>Spectrophotometers are used in methods such as the solvent extraction-gravimetric determination of oil and grease in wastewater samples. Absorbance measurements help quantify the amount of extracted material.</p>\"+\r\n\t   \"<p>• Verification of Calibration Standards:</p>\"+\r\n\t   \"<p>Spectrophotometers are used to verify the accuracy of calibration standards. Regular checks with certified reference materials ensure the reliability of the instrument for analytical measurements.</p>\"+\r\n\t   \"<p>OUR SPECTROPHOTOMETER -- Make: HACH DR 1900</p>\"+\r\n\t   \"<a href='https://in.hach.com/dr1900-portable-spectrophotometer/product-details?id=18915675455' target='_blank'>Click here to link</a>\";\r\n\t   \r\n\t   \r\n    let concatenatedParagraph = \"\";\r\n\r\n// Using the string concatenation operator\r\nconcatenatedParagraph = paragraph;\r\n\r\n// Using the concat() method\r\nconcatenatedParagraph = paragraph.concat();\r\nfrappe.web_form.set_value('details', concatenatedParagraph)\r\n\r\n}\r\n\r\n\r\n\r\n});\r\n}\r\n\r\n",
 "creation": "2023-12-28 16:09:45.326972",
 "custom_css": "[data-doctype=\"Web Form\"] main \r\n{\r\n    width:100%;\r\n}\r\nh3 {text-align: center;\r\n    color:#052e64;\r\n}\r\nh6{\r\n     color:#052e64;\r\n}\r\n\r\np {font-family: \"Times New Roman\", Times, serif;}\r\n\r\n.web-form-header{\r\n    display:none;\r\n}\r\n.web-form-footer{\r\n    display:none;\r\n}\r\n\r\n[data-doctype=\"Web Form\"] .page-content-wrapper .container .page_content .web-form {\r\n    \r\n    padding: 1.25rem 2rem 2rem;\r\n    border: none;\r\n    border-top: none;\r\n}\r\n\r\n.web-form-body .custom-div {\r\n  position: absolute;\r\n  top: 45%;\r\n  left: 55%;\r\n  transform: translate(-50%, -50%);\r\n  background-position: center;\r\n  background-repeat: no-repeat;\r\n  background-size: 10%; \r\n  opacity: 0.1;\r\n  padding: 180px;\r\n}\r\n\r\n\r\n\r\n",
 "doc_type": "Lab QR Details",
 "docstatus": 0,
 "doctype": "Web Form",
 "idx": 0,
 "is_standard": 1,
 "list_columns": [],
 "login_required": 0,
 "max_attachment_size": 0,
 "modified": "2023-12-28 16:56:11.907351",
 "modified_by": "Administrator",
 "module": "wtt_module",
 "name": "labqr",
 "owner": "Administrator",
 "published": 1,
 "route": "labqr",
 "show_attachments": 0,
 "show_list": 0,
 "show_sidebar": 0,
 "title": "labqr",
 "web_form_fields": [
  {
   "allow_read_on_all_link_options": 0,
   "fieldname": "select_name",
   "fieldtype": "Select",
   "hidden": 1,
   "label": "Data",
   "max_length": 0,
   "max_value": 0,
   "options": "\nTDS METER\nTURBIDITY METER\npH METER\nSPECTROPHOTOMETER\nChemical Oxygen Demand (COD)\nANALYTICAL BALANCE\nMUFFLE FURNACE\nJAR TEST APPARATUS\nHOT AIR OVEN\nMAGNETIC STIRRER",
   "read_only": 0,
   "reqd": 0,
   "show_in_filter": 0
  },
  {
   "allow_read_on_all_link_options": 0,
   "fieldname": "details",
   "fieldtype": "HTML",
   "hidden": 0,
   "label": "Details",
   "max_length": 0,
   "max_value": 0,
   "read_only": 0,
   "reqd": 0,
   "show_in_filter": 0
  }
 ]
}